#include<stdio.h>
//整数在内存中存储的时候使用的是补码,但是在人使用的时候，都是原码。

//移位操作符 << 和 >> 
//位操作符  &  |  ^ 
//这两个操作符只能用于整数类型，不能用于浮点数类型.

// int main(){

//     // << 左移操作符
//     //int是四个字节，32位，32位二进制数，最高位是符号位，0表示正数，1表示负数。
//     //00000000 00000000 00000000 00001010
//     // int num = 10;
//     // //左移一位，相当于乘以2
//     // //00000000 00000000 00000000 00010100
//     // int r = num << 1;
    
//     // printf("num = %d\n", num);
//     // printf("r = %d\n", r);

//     // //10000000 00000000 00000000 00001010 原码
//     // //11111111 11111111 11111111 11110101 反码
//     // //11111111 11111111 11111111 11110110 补码
//     // int num2 = -10;


//     // //11111111 11111111 11111111 11110110 补码
//     // //10000000 00000000 00000000 00010011 反码
//     // //10000000 00000000 00000000 00010100 原码
//     // int r2 = num2 << 1;

//     // printf("num2 = %d\n", num2);
//     // printf("r2 = %d\n", r2);


//     /// >> 右移操作符
//     // 逻辑右移: 左边用0填充，右边丢弃
//     // 算术右移： 左边用符号位填充，右边丢弃



//     // //10000000 00000000 00000000 00001010 原码
//     // //11111111 11111111 11111111 11110101 反码
//     // //11111111 11111111 11111111 11110110 补码
//     // int num3 = -10;


//     // //算术右移
//     // //右移1位，相当于除以2
//     // int r3 = num3 >> 1;

//     // //11111111 11111111 11111111 11111011 补码
//     // //10000000 00000000 00000000 00000100 反码    
//     // //100000000 00000000 00000000 00000101 原码
//     // printf("num3 = %d\n", num3);
//     // printf("r3 = %d\n", r3);


//     // return 0;
// }



//位操作符 & | ^ ~

//按位与&    //有0就是0
// num & 1 就能得到二进制中最低位的值
// num & 1 == 1, 就说明num最低位是1
// num & 1 == 0, 就说明num最低位是0

//按位或|    //有1就是1

//按位异或^  //相同为0，不同为1
// a ^ 0 = a
// a ^ a = 0

//按位取反~  //0变1，1变0


//交换两个数的值
int func1(int a, int b){

    printf("交换前 a = %d, b = %d\n", a, b);

    a = a ^ b;
    b = a ^ b;  // a ^ b ^ b = a
    a = a ^ b;  // a ^ b ^ a = b
    printf("交换后 a = %d, b = %d\n", a, b);

    return a;
}


// 处理十位数中二进制中有多少个是1
int func2(int num){

    int cnt = 0;

    //-10
    //10000000 00000000 00000000 00001010 原码
    //11111111 11111111 11111111 11110101 反码
    //11111111 11111111 11111111 11110110 补码
    for(int i = 0; i < 32; i++){
        if((num & (1 << i)) != 0){
            cnt++;
        }
    }
    return cnt;
}


int main(){

    int a = 10;
    int b = 20;

    int swap_num =func1(a, b);

    int result = func2(1);
    printf("result = %d\n", result);

    return 0;
}



































































